# TODOS: split by color

In [1]:
import pandas as pd

import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from utils import *

plt.style.use('../style.mplstyle')
df = pd.read_csv("../latest.csv")

c:\Users\sevi\anaconda3\lib\site-packages\scipy\__init__.py:138: UserWarning: A NumPy version >=1.16.5 and <1.23.0 is required for this version of SciPy (detected version 1.24.4)
  warnings.warn(f"A NumPy version >={np_minversion} and <{np_maxversion} is required for this version of "

In [2]:
df = fix_data(df, drop_zeros=False)

In [3]:
print("length of df: ", len(df))
print('\n')
df.head(1)

length of df:  106

,StartDate,reading,Duration,Progress,Finished,Q42,Q43,Q1,Q1_7_TEXT,Q2,...,Q16_3,Q16_4,Q16_5,Q16_6,Q16_7,Q16_8,Q16_9,Q17,Q18,Q46
0,2024-08-08 23:30:29,7,118,100,True,Agree,LinkedIn DM,Industry,NaN,2.0,...,Somewhat agree,Somewhat agree,Somewhat agree,Somewhat agree,Somewhat agree,Somewhat agree,Somewhat agree,NaN,NaN,NaN

# Literacy scores

In [4]:
# df['Q4_1']
type(df['Q4_1'])

pandas.core.series.Series

In [5]:
df['Q1']

0      Industry
1      Industry
2      Academic
3      Industry
4      Industry
         ...
101         NaN
102    Academic
103    Academic
104         NaN
105    Academic
Name: Q1, Length: 106, dtype: object

In [6]:
# df[Q1] is the pandas series of strings of the GROUP (eg. Academic, Industry, etc)

# "alignment problem, scalable oversight, etc" are stored in df['Q4_1'], df['Q4_2'], etc
safety_columns = ['Q4_1', 'Q4_2', 'Q4_3', 'Q4_4']

# "machine learning algorithms, logistic regression, etc" are stored in df['Q3_1'], df['Q3_2'], etc
ml_columns = ['Q3_1', 'Q3_2', 'Q3_3', 'Q3_4']


# df[Q4_1] is a pandas series of strings, use this to convert to quantitave data if you need
literacy_map = {
    'Never heard of it': 0,
    'Heard of it': 1,
    'Know a little': 2,
    'Know a fair amount': 3,
    'Know it well': 4
}

ml_concepts = [
    "Machine learning algorithms",
    "Logistic Regression",
    "Empirical Risk Minimization",
    "Markov random fields"
]

ai_safety_concepts = [
    "The \"AI alignment problem\"",
    "Scalable Oversight",
    "Instrumental convergence",
    "Coherent extrapolated volition"
]

# ALL researchers

In [7]:
# replace all of the strings with the numerical values
all_cols = safety_columns + ml_columns
for col in all_cols:
    df[col] = df[col].map(literacy_map)

In [31]:
df[ml_columns]

     Q3_1  Q3_2  Q3_3  Q3_4
0     3.0   4.0   0.0   0.0
1     3.0   3.0   1.0   2.0
2     4.0   4.0   4.0   2.0
3     4.0   3.0   0.0   2.0
4     4.0   4.0   1.0   1.0
..    ...   ...   ...   ...
101   NaN   NaN   NaN   NaN
102   4.0   4.0   0.0   1.0
103   4.0   3.0   0.0   3.0
104   NaN   NaN   NaN   NaN
105   3.0   3.0   2.0   2.0

[106 rows x 4 columns]

In [8]:
df[safety_columns]

     Q4_1  Q4_2  Q4_3  Q4_4
0     0.0   0.0   0.0   0.0
1     4.0   0.0   0.0   0.0
2     2.0   2.0   0.0   0.0
3     0.0   1.0   2.0   0.0
4     0.0   0.0   0.0   0.0
..    ...   ...   ...   ...
101   NaN   NaN   NaN   NaN
102   1.0   0.0   0.0   0.0
103   2.0   1.0   0.0   0.0
104   NaN   NaN   NaN   NaN
105   3.0   2.0   2.0   2.0

[106 rows x 4 columns]

In [32]:
# count the number of 3's and 4's in each column
safety_cols = df[safety_columns].apply(pd.value_counts)
empirical_cols = df[ml_columns].apply(pd.value_counts)

In [33]:
safety_cols

     Q4_1  Q4_2  Q4_3  Q4_4
0.0    18    34    45    54
1.0    10    16     9    12
2.0    17    16    13    13
3.0    20    12     8     5
4.0    21     8    10     2

In [17]:
# literacy_map = {
#     'Never heard of it': 0,
#     'Heard of it': 1,
#     'Know a little': 2,
#     'Know a fair amount': 3,
#     'Know it well': 4
# }

safety_cols

     Q4_1  Q4_2  Q4_3  Q4_4
0.0    18    34    45    54
1.0    10    16     9    12
2.0    17    16    13    13
3.0    20    12     8     5
4.0    21     8    10     2

In [18]:
print("COHERENT EV", (5+2) / (5+2+53+12+13))
print("inst convergence", 18/ (18+13+9+44))

COHERENT EV 0.08235294117647059
inst convergence 0.21428571428571427

In [19]:
df_academics = df[df['Q1'] == 'Academic']

In [27]:
# df_academics[safety_columns]
academics_safety_cols = df_academics[safety_columns].apply(pd.value_counts)
academics_empirical_cols = df_academics[ml_columns].apply(pd.value_counts)
academics_safety_cols

     Q4_1  Q4_2  Q4_3  Q4_4
0.0    10    21    31    37
1.0     7    14     8     8
2.0    13    10     6     6
3.0    14     6     6     3
4.0    12     5     5     2

In [28]:
ai_safety_concepts

['The "AI alignment problem"',
 'Scalable Oversight',
 'Instrumental convergence',
 'Coherent extrapolated volition']

In [35]:
ml_concepts

['Machine learning algorithms',
 'Logistic Regression',
 'Empirical Risk Minimization',
 'Markov random fields']

In [29]:
empirical_cols

     Q3_1  Q3_2  Q3_3  Q3_4
0.0   NaN     1    26    10
1.0   NaN     1    11    25
2.0  13.0    10    25    20
3.0  23.0    25    13    18
4.0  50.0    49    11    13

In [30]:
academics_empirical_cols

     Q3_1  Q3_2  Q3_3  Q3_4
0.0   NaN   NaN    12     3
1.0   NaN   NaN     3    16
2.0   4.0   5.0    20    12
3.0  14.0  15.0    12    13
4.0  38.0  36.0     9    12

In [38]:
25/56

0.44642857142857145